Repository: RikudouSage/SlackChatGPT
Catalog: translations/messages+intl-icu.*.xlf
Languages: cs

source: Sorry, we don't know how to handle that command.
cs: Pardon, tenhle příkaz zpracovat neumíme.

source: You must provide the mode to change to, either '{mode1}' or '{mode2}'
cs: Musíte zadat mód, na který se má bot přepnout, buď ''{mode1}'', nebo ''{mode2}''

source: The mode was already set to '{mode}'
cs: Režim už byl nastaven na ''{mode}''

source: The response mode has been changed by {user}.
cs: Režim odpovědi byl změněn uživatelem {user}.

source: I will now respond to all messages.
cs: Nyní budu odpovídat na všechny zprávy.

source: I will now only respond to direct @ mentions and threads I'm already mentioned in.
cs: Nyní budu odpovídat pouze na přímé @ zmínky a ve vláknech, jichž už jsem součástí.

source: You must provide the mode to change to, either '{mode1}' or '{mode2}'. The current mode is '{currentMode}'.
cs: Musíte uvést režím, buď ''{mode1}'', nebo ''{mode2}''. Součásný režím je ''{currentMode}''.

source: Hi there!
cs: Zdravíčko!

source: I'll respond to your messages if you mention me. You can also configure me to respond to every message in this channel by using the slash command '{command}'
cs: Budu odpovídat na vaše dotazy, pokud mě zmíníte. Můžete mě taky nastavit, abych odpovídal na všechny zprávy v tomto kanálu pomocí příkazu ''{command}'

source: I'll respond to all your messages in this channel. You can also configure me to respond only to direct mentions by using the slash command '{command}'
cs: Budu odpovídat na všechny zprávy v tomto kanálu. Můžete mě taky nastavit, abych odpovídal jen, když mě ve zprávě zmíníte, pomocí příkazu ''{command}''

source: Invalid argument '{argument}', it must be '{mode1}' or '{mode2}'
cs: Neplátná možnost ''{argument}'', musí být buď ''{mode1}'', nebo ''{mode2}''

source: The global limit for messages per day has been reached, I sadly won't be responding to any more messages.
cs: Byl překročen celkový limit pro počet zpráv za den, na další zprávy bohužel nebudu odpovídat.

source: You have reached the daily limit of messages for your account, I sadly won't be responding to any more messages from you.
cs: Dosáhli jste denního limitu zpráv pro váš účet, bohužel už na vaše zprávy odpovídat nebudu.

source: The api key you provided is not valid.
cs: Zadaný api klíč není platný.

source: Your api key has been successfully saved and usage limits won't apply to you anymore. To delete it run: {command} remove
cs: Váš api klíč byl úspěšně uložen a limity pro používání se na vás již nevztahují. Pro jeho smazání použijte: {command} remove

source: Your custom api key has been removed.
cs: Váš vlastní api klíč byl odstraněn.

source: Sadly ChatGPT didn't reply in time, maybe their servers are too busy?
cs: ChatGPT bohužel neodpověděl včas, možná jsou jejich servery příliš zaneprázdněné?

source: Do you want to try again?
cs: Chcete to zkusit znovu?

source: Yes
cs: Ano

source: No
cs: Ne

source: Ok, I won't retry sending the message.
cs: Dobře, zprávu znovu posílat nebudu.

source: Ok, I'll retry sending the message.
cs: Dobře, pošlu zprávu znovu.

source: Your message has been sent again!
cs: Vaše zpráva byla znovu odeslána!

source: Usage: {command} [apiKey] [organizationId]
cs: Použití: {command} [apiKlíč] [idOrganizace]

source: Model '{model}' is not available. You must use one of: {models}
cs: Model '{model}' není k dispozici. Musíte zvolit jedno z: {models}

source: The bot will from now on reply to you using the {model} model.
cs: Bot bude od teď odpovídat s použitím modelu {model}.

source: You are currently using the default model for this workspace, {model}.
cs: V současnosti používáte výchozí model pro tento workspace, {model}.

source: You are currently using {model}, the workspace default is {defaultModel}.
cs: V současnosti používáte {model}, výchozí nastavení pro workspace je {defaultModel}.

# Usage: {command} [model|status]&#10;Where model is one of: {models}
source: Usage: {command} [model|status] Where model is one of: {models}
cs: Použití: {command} [model|status] Kde model je jeden z: {models}
